snlkuharlocal/src/Documents/ПланЗагрузки/ПланЗагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланЗагрузки</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПланЗагрузки/ObjectModule.bsl
Перем СписокДоступныхСостояний;
 
 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	 Если НЕ ОбменДанными.Загрузка Тогда	
		 Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
			 
			 
			 ТЗДокументов = ЛистыНабора.Выгрузить(,"Документ");
			 ТЗДокументов.Свернуть("Документ");
			 //ЗапросКоличествоЛН = Новый Запрос;
			 //ЗапросКоличествоЛН.Текст = "ВЫБРАТЬ
			 //						   |	СУММА(1) КАК КоличествоЛН,
			 //						   |	ЛистНабора.ДокОснование КАК Документ
			 //						   |ИЗ
			 //						   |	Документ.ЛистНабора КАК ЛистНабора
			 //						   |ГДЕ
			 //						   |	ЛистНабора.ДокОснование В(&СписокДокОснований)
			 //						   |	И ЛистНабора.Проведен
			 //						   |
			 //						   |СГРУППИРОВАТЬ ПО
			 //						   |	ЛистНабора.ДокОснование";
			 //   						ЗапросКоличествоЛН.УстановитьПараметр("СписокДокОснований",ТЗДокументов.ВыгрузитьКолонку("Документ"));
			 //   						Выборка = ЗапросКоличествоЛН.Выполнить().Выбрать();
			 //   						Пока Выборка.Следующий() Цикл
			 //   						Сообщить(Выборка.Документ+ "//"+Выборка.КоличествоЛН);	
			 //   						КонецЦикла;
			 Для Каждого СтрокаТЗ ИЗ ТЗДокументов Цикл
				 //проверка документов
				 Документ = СтрокаТЗ.Документ;
				 Если НЕ Документ.Проведен Тогда
					 Отказ = Истина;
					 СообщитьИзМодуля("Документ "+СтрокаТЗ.Документ+" не проведен! Сохранение невозможно!");
					 
				 КонецЕсли;
				 
				 
				 Если СписокДоступныхСостояний.НайтиПоЗначению(Документ.СостояниеНакладной) = Неопределено  Тогда
					 
					 Отказ = Истина;
					 СообщитьИзМодуля("Неверное состояние документа "+СтрокаТЗ.Документ+"! Сохранение невозможно!");
				 КонецЕсли;
				 //проверка полноты ЛН в накладных   - пока нет
				 
			 КонецЦикла;	
			 
			 
			 
		 КонецЕсли;
	 КонецЕсли;
	 
 КонецПроцедуры
 
 
 Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	 ТЗДокументов = ЛистыНабора.Выгрузить(,"Документ");
	 ТЗДокументов.Свернуть("Документ");
	 Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		 Для Каждого СтрокаТЗ ИЗ ТЗДокументов Цикл
			 ДокОбъект = СтрокаТЗ.Документ.ПолучитьОбъект();
			 Если ДокОбъект.Состояниенакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.Отгружена;
				 ДокОбъект.Отгружен = Перечисления.Отгружен.Отгружен;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
		 Для Каждого СтрокаТЗ Из Паллеты Цикл
			 ДокОбъект = строкаТЗ.Паллета.ПолучитьОбъект();
			 Если ДокОбъект.СостояниеНакладной <>  Перечисления.СостоянияНакладной.Отгружена Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.Отгружена;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
	 ИначеЕсли СостояниеНакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
		 Для Каждого СтрокаТЗ ИЗ ТЗДокументов Цикл
			 ДокОбъект = СтрокаТЗ.Документ.ПолучитьОбъект();
			 Если ДокОбъект.Состояниенакладной <> Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад;
				 ДокОбъект.Отгружен = Перечисления.Отгружен.ОтгруженТранзит;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
		 Для Каждого СтрокаТЗ Из Паллеты Цикл
			 ДокОбъект = строкаТЗ.Паллета.ПолучитьОбъект();
			 Если ДокОбъект.СостояниеНакладной <>  Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
		 
		 
	 Иначе
		 Для Каждого СтрокаТЗ ИЗ ТЗДокументов Цикл
			 ДокОбъект = СтрокаТЗ.Документ.ПолучитьОбъект();
			 Если ДокОбъект.Состояниенакладной <> Перечисления.СостоянияНакладной.ВМашине Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ВМашине;
				 ДокОбъект.Отгружен = Перечисления.Отгружен.Резерв;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
		 Для Каждого СтрокаТЗ Из Паллеты Цикл
			 ДокОбъект = строкаТЗ.Паллета.ПолучитьОбъект();
			 Если ДокОбъект.СостояниеНакладной <>  Перечисления.СостоянияНакладной.ВМашине Тогда
				 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ВМашине;
				 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
			 КонецЕсли;
		 КонецЦикла;
		 
	 КонецЕсли;
 КонецПроцедуры
 
 Процедура ОбработкаУдаленияПроведения(Отказ)
	 ТЗДокументов = ЛистыНабора.Выгрузить(,"Документ");
	 ТЗДокументов.Свернуть("Документ");
	 Для Каждого СтрокаТЗ ИЗ ТЗДокументов Цикл
		 ДокОбъект = СтрокаТЗ.Документ.ПолучитьОбъект();
		 Если ДокОбъект.Состояниенакладной <> Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
			 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
		 КонецЕсли;
	 КонецЦикла;
	 Для Каждого СтрокаТЗ Из Паллеты Цикл
		 ДокОбъект = строкаТЗ.Паллета.ПолучитьОбъект();
		 Если ДокОбъект.СостояниеНакладной <>  Перечисления.СостоянияНакладной.ГотоваКОтгрузке Тогда
			 ДокОбъект.Состояниенакладной = Перечисления.СостоянияНакладной.ГотоваКОтгрузке;
			 ДокОбъект.записать(РежимЗаписиДокумента.Проведение);
		 КонецЕсли;
	 КонецЦикла;
	 
	 
 КонецПроцедуры
 
 
 
 СписокДоступныхСостояний = Новый СписокЗначений;
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ГотоваКОтгрузке);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ВМашине);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.Отгружена);
 СписокДоступныхСостояний.Добавить(Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
